class Txt:

    TEXT = """●     °    •      ○    ●   •  ●    ○   •  ●
○       ●      °    ●    •     ○   ●   ○  •
ㅤㅤㅤㅤㅤㅤ(*≧ω≦*)
┏━━━━━━━  ✦  ✦ ━━━━━━━━┓
┃🔈 𝗡𝗔𝗠𝗘       ○○○  ` {first_name} `
┃👥 𝗠𝗘𝗡𝗧𝗜𝗢𝗡   ○○○  ` {mention} `
┃🆔 𝗜𝗗         ○○○  ` {id} `
┃👤 𝗨𝗦𝗘𝗥𝗡𝗔𝗠𝗘   ○○○  ` {username} `
┗━━━━━━━━ ✦ ✦━━━━━━━━┛"""

    ###############################################################################################

    TEXT_MESSAGE1 = """*☞☞☞  H E L P   P A G E  ☚☚☚*

☞ ⚙️ ` /settings ` — *Set or delete your settings*  
☞ 🗂 ` /editmedia ` — *Edit media without deleting*  
☞ ⌨️ ` /set_chatid ` — *Set Chat ID (only for channels, add me as admin)*"""

    ###############################################################################################

    TEXT_MESSAGE2 = """👋 𝐊𝐎𝐍𝐈𝐂𝐇𝐈𝐖𝐀, `{first_name}`

➀ 😏 *🆃🅷🅸🆂 🅱🅾🆃 🅸🆂 🆂🅴🅼🅸-🅿🆁🅸🆅🅰🆃🅴*  
↪️ 𝙻𝙸𝙼𝙸𝚃𝙴𝙳 𝙰𝙲𝙲𝙴𝚂𝚂, 𝙽𝙾𝚃 𝙵𝚄𝙻𝙻𝚈 𝙿𝚄𝙱𝙻𝙸𝙲.

➁ 🧑‍💻 *𝐁𝐀𝐒𝐄𝐃 𝐎𝐍 𝐏𝐘𝐑𝐎-𝐁𝐎𝐓𝐙*  
↪️ 🅄🅂🄸🄽🄶 🅃🄷🄴 🄿🅈🅁🄾-🄱🄾🅃🅉 🅁🄴🄿🄾 🄰🅂 🄱🄰🅂🄴 𝚆𝙸𝚃𝙷 𝙼𝚈 𝙾𝚆𝙽 𝙴𝙽𝙷𝙰𝙽𝙲𝙴𝙼𝙴𝙽𝚃𝚂.

➂ 📮 *𝐈𝐃𝐄𝐀𝐒 𝐅𝐑𝐎𝐌 𝐎𝐓𝐇𝐄𝐑 𝐁𝐎𝐓𝐒*  
↪️ 𝚁𝙴𝚄𝚂𝙴𝙳 & 𝙼𝙾𝙳𝙸𝙵𝙸𝙴𝙳 𝙸𝙳𝙴𝙰𝚂 𝙵𝚁𝙾𝙼 𝙲𝙾𝙾𝙻 𝙱𝙾𝚃𝚂.

➃ ❌ *𝐍𝐎𝐓 𝐀 𝐏𝐑𝐎𝐅𝐄𝐒𝐒𝐈𝐎𝐍𝐀𝐋 𝐃𝐄𝐕*  
↪️ 𝐉𝐔𝐒𝐓 𝐀 𝐇𝐎𝐁𝐁𝐘𝐈𝐒𝐓 𝐖𝐇𝐎 𝐋𝐈𝐊𝐄𝐒 𝐁𝐎𝐓 𝐅𝐄𝐀𝐓𝐔𝐑𝐄𝐒 😎"""

    ###############################################################################################

    TEXT_MESSAGE3 = """
👤 [𝙲𝚁𝙴𝙳𝙸𝚃𝚂](tg://user?id={id})  
━━━━━━━━━━━━━━━━━━━━━

🛠 *🄲🅁🄴🄰🅃🄾🅁🅂 🄾🄵 🄿🅈🅁🄾-🄱🄾🅃🅉*  
➤ +2𝐆𝐁 𝗦𝗵𝗮𝗱𝗼𝘄 𝗕𝗹𝗮𝗱𝗲  
➤ 𝘾𝙤𝙣𝙘𝙚𝙥𝙩𝙨 𝙁𝙧𝙤𝙢 𝙊𝙩𝙝𝙚𝙧𝙨  
➤ `𝙈𝙮𝙨𝙚𝙡𝙛`

🎯 *𝐁𝐎𝐓 𝐁𝐘* [{first_name}](tg://user?id={id})

─────────────────────

ℹ️ *𝙁𝙊𝙍 𝙎𝙐𝙋𝙋𝙊𝙍𝙏 & 𝙃𝙀𝙇𝙋:*  
• 👤 [𝘾𝙧𝙚𝙖𝙩𝙤𝙧](tg://user?id={id})  
• 💬 [𝐆𝐑𝐎𝐔𝐏](https://t.me/KIRIGAYA_ASUNA)  
• 📢 [𝐂𝐇𝐀𝐍𝐍𝐄𝐋](https://t.me/kirigayayuki)  
• ✉️ [𝐂𝐎𝐍𝐓𝐀𝐂𝐓](http://t.me/devil_testing_bot)  
• 🛠 [𝐌𝐎𝐃𝐈𝐅𝐈𝐄𝐑](https://t.me/kirigaya_asuna)
"""
    ###############################################################################################

    PROGRESS_BAR = """<b>\n
╭━━━━❰ᴘʀᴏɢʀᴇss ʙᴀʀ❱━➣
┣⪼ 🗃️ Sɪᴢᴇ: {1} | {2}
┣⪼ ⏳️ Dᴏɴᴇ : {0}%
┣⪼ 🚀 Sᴩᴇᴇᴅ: {3}/s
┣⪼ ⏰️ Eᴛᴀ: {4}
╰━━━━━━━━━━━━━━━➣ </b>"""
